# Cross-platform installations (will work on both Mac and Linux)
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "fzf" # Command-line fuzzy finder written in Go
brew "git" # Distributed revision control system
brew "lazygit" # Git GUI with a terminal interface
brew "mise" # Tool to manage multiple versions of development tools
brew "powerlevel10k" # Theme for zsh
brew "python" # Interpreted, interactive, object-oriented programming language
brew "wget" # Internet file retriever
brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew "zsh-you-should-use" # Set of warnings for the zsh shell

# Mac-specific installations
if OS.mac?
    brew "mas" # Mac App Store command-line interface
    # Mac-specific casks
    cask "arc" # Web browser
    cask "chatgpt" # OpenAI's official ChatGPT desktop app
    cask "displaylink" # Drivers for DisplayLink docks, adapters and monitors
    cask "font-meslo-lg-nerd-font" # Custom font for terminal
    cask "font-cascadia-code" # Monospaced font from Microsoft, great for coding
    cask "google-chrome" # Web browser
    cask "logi-options+" # Software for Logitech devices
    cask "notion" # App to write, plan, collaborate, and get organized
    cask "slack" # Team communication and collaboration software
    cask "spotify" # Music streaming service
    cask "visual-studio-code" # Open-source code editor
    cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app

    # Mac App Store apps
    mas "Keynote", id: 409183694 # Presentation software
    mas "Notability", id: 360593530 # Note-taking app
    mas "Numbers", id: 409203825 # Spreadsheet software
    mas "Pages", id: 409201541 # Word processor
    mas "Xcode", id: 497799835 # Integrated development environment for macOS
end
